app/Models/Esp32.php

SELECT `u`.`nombre_usuario`, `e`.`ubicacion`, `e`.`ID_dispositivo`
FROM `disp_esp32` `e`
JOIN `dispositivos` `d` ON `d`.`ID_esp32` = `e`.`ID_dispositivo`
JOIN `acceso_usuarios` `au` ON `au`.`ID_dispositivo` = `d`.`ID_dispositivo`
JOIN `usuarios` `u` ON `u`.`ID_usuario` = `au`.`ID_usuario`
WHERE `u`.`ID_usuario` = '4'
GROUP BY `u`.`ID_usuario`, `e`.`ID_dispositivo`
---
    public function getEsp32byUser($id)
    {

        $builder = $this->db->table('disp_esp32 e');
        $builder->select('u.nombre_usuario, e.ubicacion, e.ID_dispositivo, e.direccion_ip, e.codigo');
        $builder->join('dispositivos d', 'd.ID_esp32 = e.ID_dispositivo');
        $builder->join('acceso_usuarios au', 'au.ID_dispositivo = d.ID_dispositivo');
        $builder->join('usuarios u', 'u.ID_usuario = au.ID_usuario');
        $builder->where('u.ID_usuario', $id);
        $builder->groupBy('u.ID_usuario, e.ID_dispositivo');

        $query = $builder->get();

SELECT `d`.`nombre`
FROM `dispositivos` `d`
JOIN `disp_esp32` `e` ON `e`.`ID_dispositivo`=`d`.`ID_esp32`
JOIN `acceso_usuarios` `au` ON `au`.`ID_dispositivo`=`d`.`ID_dispositivo`
JOIN `usuarios` `u` ON `u`.`ID_usuario`=`au`.`ID_usuario`
WHERE `e`.`ID_dispositivo` = '1 '
AND `u`.`ID_usuario` = '4'
---
    public function getDevicesbyEsp($esp,$user){

        $table = $this->db->table('dispositivos d');
        $table->select('d.nombre,d.ID_tipo,d.ID_dispositivo');
        $table->join('disp_esp32 e','e.ID_dispositivo=d.ID_esp32');
        $table->join('acceso_usuarios au','au.ID_dispositivo=d.ID_dispositivo');
        $table->join('usuarios u','u.ID_usuario=au.ID_usuario');
        $table->where(['e.ID_dispositivo'=> $esp,'u.ID_usuario'=> $user]);

        return $table->get()->getResultArray();