app/Models/Login_attemps.php

    public function insertLoginattemp($id=null,$exitoso,$ip){

        $table=$this->db->table("login_attemps");
        $data=[
            "ID_usuario"=>$id,
            "exitoso"=>$exitoso,
            "direccion_ip"=> $ip
        ];

        $table->insert($data);
---
INSERT INTO `login_attemps` (`ID_usuario`, `exitoso`, `direccion_ip`) VALUES (NULL, 0, '::1')